ExchangePlans/ОбменСКассовымСерверомШтрихМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ExchangePlan>
		<Properties>
			<Name>ОбменСКассовымСерверомШтрихМ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьОбменССерверомШтрихМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоДокументаВЗапросе</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНаСервереШтрихМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбластиНаСервереШтрихМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСоединенияИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеВедениеЖурналаРегистрацииДляОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/ОбменСКассовымСерверомШтрихМ/Forms/ФормаУзла/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиСервер.ПроверитьВозможностьАдминистрированияОбменов();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		Элементы.ПараметрыДоступаВИнтернет.Видимость = Истина;
	Иначе
		Элементы.ПараметрыДоступаВИнтернет.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "password", Истина);
		Подпись = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "signature", Истина);
		ЕстьЗарегистрированныеКассы = ОбменСКассовымСерверомШтрихМ.ЕстьПодключенныеКассы();
	Иначе
		Объект.Код = "002";
		Объект.Наименование =
			НСтр("ru='Настройка обмена с кассовым сервером Штрих-М'", ОбщегоНазначения.КодОсновногоЯзыка());
		Объект.СтрокаСоединенияИнформационнойБазы = СтрокаСоединенияИнформационнойБазы();
		Объект.МаксимальноеКоличествоДокументов = 10000;
		Объект.ВыполнятьОбменССерверомШтрихМ = Ложь;
	КонецЕсли;
	
	
	ПриИзмененииПодписи();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Ссылка, Пароль, "password");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Ссылка, Подпись, "signature");
	Модифицированность = Ложь;
	ОбменСКассовымСерверомШтрихМ.УстановитьИспользованиеРегламентногоЗадания();
	
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура АдресСервераПриИзменении(Элемент)
	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторНаСервереШтрихМПриИзменении(Элемент)
	
	УстановитьДоступность();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьПодпись(Команда)
	
	ПараметрыФормы = Новый Структура("ИдентификаторСервиса", Объект.ИдентификаторНаСервереШтрихМ);
	ПараметрыФормы.Вставить("ТекущаяПодпись", Подпись);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКлючевогоСлова", ЭтотОбъект);
	ОткрытьФорму("ПланОбмена.ОбменСКассовымСерверомШтрихМ.Форма.АутентификацияНаСервереШтрихМ",
		ПараметрыФормы,,,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИдентификатор(Команда)
	
	ЗаголовокВопроса = НСтр("ru = 'Очистка идентификатора подсистемы'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	ТекстВопроса = НСтр("ru = 'Очистка идентификатора подсистемы приведет
		|к регистрации новой подсистемы на сервере Штрих-М.'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	Если ЕстьЗарегистрированныеКассы Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Также это приведет к перерегистрации кассовых аппаратов,
		|товаров и документов в новую подсистему из существующей.'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = 'Выполнить очистку идентификатора подсистемы (agent_node_id)?'",
		ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
		
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да,
		НСтр("ru = 'Выполнить'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена,
		НСтр("ru = 'Отменить'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОчистить", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок,, КодВозвратаДиалога.Отмена, ЗаголовокВопроса);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыДоступаВИнтернет(Команда)
	
	ОбменДаннымиКлиент.ОткрытьФормуПараметровПроксиСервера();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	Элементы.Пароль.РежимПароля = НЕ Элементы.Пароль.РежимПароля;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодпись(Команда)
	
	Элементы.Подпись.РежимПароля = НЕ Элементы.Подпись.РежимПароля;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Настройки = Новый Структура;
	Настройки.Вставить("АдресСервера", Объект.АдресСервера);
	Настройки.Вставить("ИмяПользователя", Объект.ИмяПользователя);
	Настройки.Вставить("Пароль", Пароль);
	
	Соединение = HTTPСоединениеНаСевере(Настройки);

	Если Соединение.HTTPСоединение = Неопределено Тогда
		СтрокаПредупреждения = Соединение.СообщениеОбОшибке;
	Иначе
		СтрокаПредупреждения = НСтр("ru = 'Соединенение успешно установлено.'",
			ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	КонецЕсли;
	ЗаголовокПредупреждения = НСтр("ru = 'Проверка подключения'",
			ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	ПоказатьПредупреждение(, СтрокаПредупреждения,, ЗаголовокПредупреждения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВводаКлючевогоСлова(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено И ЗначениеЗаполнено(Результат) И НЕ Подпись = Результат Тогда
		Подпись = Результат;
		Модифицированность = Истина;
		ПриИзмененииПодписи();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОчистить(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = Неопределено И Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ИдентификаторОбластиНаСервереШтрихМ = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПодписи()
	
	Если ЗначениеЗаполнено(Подпись) Тогда
		Элементы.ИзменитьПодпись.Заголовок = НСтр("ru='Изменить'", ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		Элементы.ИзменитьПодпись.Заголовок = НСтр("ru='Заполнить'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Функция HTTPСоединениеНаСевере(Настройки)
	Соединение = ОбменСКассовымСерверомШтрихМ.HTTPСоединение(Настройки);
	Если НЕ Соединение.HTTPСоединение = Неопределено Тогда
		Соединение.HTTPСоединение = Истина;
	КонецЕсли;
	
	Возврат Соединение;
КонецФункции

&НаСервере
Процедура УстановитьДоступность()
	
	ВозможноВыполнятьОбмен = ЗначениеЗаполнено(Объект.АдресСервера)
		И ЗначениеЗаполнено(Объект.ИдентификаторНаСервереШтрихМ)
		И ЗначениеЗаполнено(Подпись);
	
	Если НЕ ВозможноВыполнятьОбмен И Объект.ВыполнятьОбменССерверомШтрихМ Тогда
		Объект.ВыполнятьОбменССерверомШтрихМ = Ложь;
	КонецЕсли;
	
	Элементы.ВыполнятьОбменССерверомШтрихМ.Доступность = ВозможноВыполнятьОбмен;
	Элементы.ИзменитьПодпись.Доступность = ЗначениеЗаполнено(Объект.ИдентификаторНаСервереШтрихМ);
	
	Элементы.ПоказатьПароль.Доступность = ЗначениеЗаполнено(Пароль);
	Элементы.ПоказатьПодпись.Доступность = ЗначениеЗаполнено(Подпись);
	Элементы.ОчиститьИдентификатор.Доступность = ЗначениеЗаполнено(Объект.ИдентификаторОбластиНаСервереШтрихМ);
КонецПроцедуры

#КонецОбласти
